### taps
tap "homebrew/bundle"
tap "homebrew/core"

### packages
brew "anyenv"
brew "bat"
brew "direnv"
brew "ethereum"
brew "exa"
brew "fish"
brew "fzf"
brew "gcc"
brew "ghq"
brew "git"
brew "gnu-sed"
brew "groonga"
brew "helm"
brew "htop"
brew "jq"
brew "just"
brew "kubectx"
brew "kustomize"
brew "nkf"
brew "pulumi"
brew "solidity"
brew "speedtest"
brew "ssh-copy-id"
brew "starship"
brew "t-rec"
brew "tldr"
brew "tree"
brew "watch"
brew "yq"


### macOS only
if OS.mac?
    ### config
    cask_args appdir: "/Applications"

    ### taps
    tap "homebrew/cask"
    tap "wez/wezterm"

    ### macOS applications
    cask "alfred"
    cask "spectacle"
    cask "coteditor"
    cask "google-chrome"
    cask "docker"
    cask "visual-studio-code"
    cask "vivaldi"
    cask "appcleaner"
    cask "iterm2"
    cask "wezterm"
    cask "raspberry-pi-imager"
    # cask "hammerspoon"
    # cask "bettertouchtool"
    # cask "mockoon"
end