### taps
tap "homebrew/bundle"
tap "homebrew/core"

### packages
brew "fish"
brew "starship"
brew "just"
brew "git"
brew "ghq"
brew "gcc"
brew "fzf"
brew "anyenv"
brew "direnv"
brew "jq"
brew "yq"
brew "tldr"
brew "exa"
brew "bat"
brew "gnu-sed"
brew "tree"
brew "htop"
brew "bpytop"
brew "ssh-copy-id"
brew "watch"
brew "httpie"
brew "nkf"
brew "helm"
brew "kubectx"
brew "kustomize"
brew "t-rec"


### macOS only
if OS.mac?
    ### config
    Brewfilecask_args appdir: "/Applications"

    ### taps
    tap "homebrew/cask"
    tap "wez/wezterm"

    ### macOS applications
    cask 'alfred'
    cask 'spectacle'
    cask 'coteditor'
    cask 'docker'
    cask 'visual-studio-code'
    cask 'vivaldi'
    cask 'appcleaner'
    cask 'iterm2'
    cask 'wezterm'
    # cask 'hammerspoon'
    # cask 'bettertouchtool'
    # cask 'mockoon'
end