cask_args appdir: "/Applications"

## commands
brew "fish"
brew "starship"
brew "tmux"
brew "git"
brew "ghq"
brew "peco"
brew "docker"
brew "direnv"
brew "jq"
brew "tldr"
brew "exa"
brew "bat"
brew "tree"
brew "ssh-copy-id"
brew "watch"
brew "httpie"
brew "nkf"
brew "mysql"
brew "gradle"

# brew "ngrok"

## Applications
cask 'slack'
cask 'alfred'
cask 'spectacle'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'hammerspoon'
cask 'coteditor'

# cask 'iterm2'


## Development Applications
cask 'docker'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'jetbrains-toolbox'

# cask 'bettertouchtool'
# cask 'mockoon'
